#+TITLE: Cross cluster vm migration demo
#+DATE: <2026-03-16 Mon>


This guide will capture the flow I used to set up an environment that demonstrates how to live migrate a virtual machine between two OpenShift clusters. The aim of this document is to make it trivial for me to recreate the same demonstration in future.


* Pre-requisites

** Kubernetes tools

This guide assumes you have the ~oc~ OpenShift Client already installed locally.


** Base infrastructure

This guide assumes you already have an OpenShift cluster and Red Hat Advanced Cluster Management in place. For my purposes I used the standard [[https://catalog.demo.redhat.com/services/user-jablair-redhat-com/published.ocp4-acm-demo.prod-lbjhr][RHACM demo base environment]].

Before we begin, let's ensure we are logged into the base cluster with ~oc~:

#+NAME: Login to openshift hub cluster
#+begin_src bash
source .env
oc login "${HUB_API_URL}" --username "${HUB_USERNAME}" --password "${HUB_PASSWORD}" --insecure-skip-tls-verify
#+end_src

#+RESULTS: Login to openshift hub cluster
#+begin_example
WARNING: Using insecure TLS client config. Setting this option is not supported!

Login successful.

You have access to 92 projects, the list has been suppressed. You can list all projects with 'oc projects'

Using project "default".
#+end_example


We also want to give our hub kube context a specific name so we can refer to it programatically moving forward:

#+NAME: Set hub context name
#+begin_src bash
oc config rename-context $(oc config current-context) hub
#+end_src

#+RESULTS: Set hub context name
#+begin_example
Context "default/api-cluster-2f9mj-dynamic-redhatworkshops-io:6443/admin" renamed to "hub".
#+end_example


* Configuring the hub cluster


** Install virt operator

Our hub cluster is not currently running OpenShift Virtualization, we need to enable that by installing the operator, we can do that by creating a ~Subscription~

#+NAME: Create virt subscription
#+begin_src bash
cat << EOF | oc --context hub apply --filename -
apiVersion: v1
kind: Namespace
metadata:
  name: openshift-cnv
spec:
  finalizers:
  - kubernetes

---
apiVersion: operators.coreos.com/v1alpha1
kind: Subscription
metadata:
  name: kubevirt-hyperconverged
  namespace: openshift-cnv
spec:
  channel: stable
  installPlanApproval: Automatic
  name: kubevirt-hyperconverged
  source: redhat-operators
  sourceNamespace: openshift-marketplace

---
apiVersion: operators.coreos.com/v1
kind: OperatorGroup
metadata:
  name: openshift-cnv
  namespace: openshift-cnv
spec:
  targetNamespaces:
  - openshift-cnv
  upgradeStrategy: Default
EOF
#+end_src

#+RESULTS: Create virt subscription
#+begin_example
namespace/openshift-cnv created
subscription.operators.coreos.com/kubevirt-hyperconverged created
operatorgroup.operators.coreos.com/openshift-cnv created
#+end_example


** Create hyperconverged resource

Once the operator is installed we can create the mandatory ~hyperconverged~ custom resource definition to enable virtualization.  Note we are specifically enabling the new ~decentralizedLiveMigration~ feature gate which will enable us to use cross cluster live migration.

#+NAMEL: Create hyperconverged resource
#+begin_src bash
cat << EOF | oc --context hub apply --filename -
apiVersion: hco.kubevirt.io/v1beta1
kind: HyperConverged
metadata:
  annotations:
    deployOVS: "false"
  finalizers:
  - kubevirt.io/hyperconverged
  labels:
    app: kubevirt-hyperconverged
  name: kubevirt-hyperconverged
  namespace: openshift-cnv
spec:
  applicationAwareConfig:
    allowApplicationAwareClusterResourceQuota: false
    vmiCalcConfigName: DedicatedVirtualResources
  certConfig:
    ca:
      duration: 48h0m0s
      renewBefore: 24h0m0s
    server:
      duration: 24h0m0s
      renewBefore: 12h0m0s
  deployVmConsoleProxy: false
  enableApplicationAwareQuota: false
  enableCommonBootImageImport: true
  evictionStrategy: None
  featureGates:
    alignCPUs: false
    decentralizedLiveMigration: true
    declarativeHotplugVolumes: false
    deployKubeSecondaryDNS: false
    disableMDevConfiguration: false
    downwardMetrics: false
    enableMultiArchBootImageImport: false
    persistentReservation: false
  higherWorkloadDensity:
    memoryOvercommitPercentage: 100
  infra: {}
  liveMigrationConfig:
    allowAutoConverge: false
    allowPostCopy: false
    completionTimeoutPerGiB: 150
    parallelMigrationsPerCluster: 5
    parallelOutboundMigrationsPerNode: 2
    progressTimeout: 150
  resourceRequirements:
    vmiCPUAllocationRatio: 10
  uninstallStrategy: BlockUninstallIfWorkloadsExist
  virtualMachineOptions:
    disableFreePageReporting: false
    disableSerialConsoleLog: false
  workloadUpdateStrategy:
    batchEvictionInterval: 1m0s
    batchEvictionSize: 10
    workloadUpdateMethods:
    - LiveMigrate
  workloads: {}
EOF
#+end_src

#+RESULTS:
#+begin_example
hyperconverged.hco.kubevirt.io/kubevirt-hyperconverged created
#+end_example


* Provision additional cluster

We're going to need more than one cluster if we want to migrate between clusters. This particular demonstration environment already has Red Hat Advanced Cluster Management in place so we'll leverage that to quickly provision an additional cluster running in AWS.


** Create infrastructure secret

We need create an aws credential in order for RHACM to be able to create a cluster for us, this will need an aws key along with an ssh key, let's create that now, starting with the ssh key.

#+NAME: Generate an ssh key
#+begin_src bash
echo y | ssh-keygen -t rsa -b 2048 -N '' -q -f key
#+end_src


#+NAME: Create infrastructure secret
#+begin_src bash
source .env
SSH_PUBLIC_KEY=$(cat key.pub)
SSH_PRIVATE_KEY=$(awk -v ORS='\\n' '1' key)

cat << EOF | envsubst | oc --context hub apply --filename -
apiVersion: v1
kind: Secret
type: Opaque
metadata:
  name: aws
  namespace: open-cluster-management
  labels:
    cluster.open-cluster-management.io/type: aws
    cluster.open-cluster-management.io/credentials: ""
stringData:
  aws_access_key_id: ${AWS_ACCESS_KEY}
  aws_secret_access_key: ${AWS_SECRET_ACCESS_KEY}
  baseDomain: ${AWS_DNS_DOMAIN}
  pullSecret: >+
    ${PULL_SECRET}
  ssh-privatekey: |
    ${SSH_PRIVATE_KEY}
  ssh-publickey: >+
    ${SSH_PUBLIC_KEY}
  httpProxy: ""
  httpsProxy: ""
  noProxy: ""
  additionalTrustBundle: ""

EOF
#+end_src

#+RESULTS: Create infrastructure secret
#+begin_example
secret/aws created
#+end_example


** Create cluster deployment resource

Once our infrastructure credential is created we can create a ~clusterdeployment~ and associated resources which advanced cluster management will watch for and execute to provision the new cluster.

#+NAME: Create clusterdeployment resource
#+begin_src bash
source .env
SSH_PUBLIC_KEY=$(cat key.pub)
SSH_PRIVATE_KEY=$(awk -v ORS='\\n' '1' key)

cat << EOF | envsubst | oc --context hub apply --filename -
apiVersion: hive.openshift.io/v1
kind: ClusterDeployment
metadata:
  name: edge-cluster
  namespace: edge-cluster
  labels:
    cloud: AWS
    region: ${AWS_REGION}
    vendor: OpenShift
    cluster.open-cluster-management.io/clusterset: 'default'
spec:
  baseDomain: ${AWS_DNS_DOMAIN}
  clusterName: edge-cluster
  controlPlaneConfig:
    servingCertificates: {}
  installAttemptsLimit: 1
  installed: false
  platform:
    aws:
      credentialsSecretRef:
        name: edge-cluster-aws-creds
      region: ${AWS_REGION}
  provisioning:
    installConfigSecretRef:
      name: edge-cluster-install-config
    sshPrivateKeySecretRef:
      name: edge-cluster-ssh-private-key
    imageSetRef:
       #quay.io/openshift-release-dev/ocp-release:4.21.5-multi
      name: img4.21.5-multi-appsub
  pullSecretRef:
    name: edge-cluster-pull-secret

---
apiVersion: cluster.open-cluster-management.io/v1
kind: ManagedCluster
metadata:
  labels:
    cloud: Amazon
    region: ${AWS_REGION}
    name: edge-cluster
    vendor: OpenShift
    cluster.open-cluster-management.io/clusterset: 'default'
  name: edge-cluster
spec:
  hubAcceptsClient: true

---
apiVersion: hive.openshift.io/v1
kind: MachinePool
metadata:
  name: edge-cluster-worker
  namespace: edge-cluster
spec:
  clusterDeploymentRef:
    name: edge-cluster
  name: worker
  platform:
    aws:
      rootVolume:
        iops: 2000
        size: 100
        type: io1
      type: m5.xlarge
  replicas: 0

---
apiVersion: v1
kind: Secret
metadata:
  name: edge-cluster-pull-secret
  namespace: edge-cluster
stringData:
  .dockerconfigjson: |-
    ${PULL_SECRET}
type: kubernetes.io/dockerconfigjson

---
apiVersion: v1
kind: Secret
metadata:
  name: edge-cluster-install-config
  namespace: edge-cluster
type: Opaque
data:
  install-config.yaml: YXBpVmVyc2lvbjogdjEKbWV0YWRhdGE6CiAgbmFtZTogJ2VkZ2UtY2x1c3RlcicKYmFzZURvbWFpbjogc2FuZGJveDI2Nzcub3BlbnRsYy5jb20KY29udHJvbFBsYW5lOgogIGh5cGVydGhyZWFkaW5nOiBFbmFibGVkCiAgbmFtZTogbWFzdGVyCiAgcmVwbGljYXM6IDMKICBwbGF0Zm9ybToKICAgIGF3czoKICAgICAgcm9vdFZvbHVtZToKICAgICAgICBpb3BzOiA0MDAwCiAgICAgICAgc2l6ZTogMTAwCiAgICAgICAgdHlwZTogaW8xCiAgICAgIHR5cGU6IG01LnhsYXJnZQpjb21wdXRlOgotIGh5cGVydGhyZWFkaW5nOiBFbmFibGVkCiAgbmFtZTogJ3dvcmtlcicKICByZXBsaWNhczogMAogIHBsYXRmb3JtOgogICAgYXdzOgogICAgICByb290Vm9sdW1lOgogICAgICAgIGlvcHM6IDIwMDAKICAgICAgICBzaXplOiAxMDAKICAgICAgICB0eXBlOiBpbzEKICAgICAgdHlwZTogbTUueGxhcmdlCm5ldHdvcmtpbmc6CiAgbmV0d29ya1R5cGU6IE9WTkt1YmVybmV0ZXMKICBjbHVzdGVyTmV0d29yazoKICAtIGNpZHI6IDEwLjEyOC4wLjAvMTQKICAgIGhvc3RQcmVmaXg6IDIzCiAgbWFjaGluZU5ldHdvcms6CiAgLSBjaWRyOiAxMC4wLjAuMC8xNgogIHNlcnZpY2VOZXR3b3JrOgogIC0gMTcyLjMwLjAuMC8xNgpwbGF0Zm9ybToKICBhd3M6CiAgICByZWdpb246IHVzLWVhc3QtMQpwdWxsU2VjcmV0OiAiIiAjIHNraXAsIGhpdmUgd2lsbCBpbmplY3QgYmFzZWQgb24gaXQncyBzZWNyZXRzCnNzaEtleTogfC0KICAgIHNzaC1yc2EgQUFBQUIzTnphQzF5YzJFQUFBQURBUUFCQUFBQkFRQzBQSStpVnRFS2pCQ2V4RmJyU25rVnhCcHlobzYveXVldEFuNzZ3eENVeXh0NXNpemhZOXZkZHo2OWtmSmxDOUFhL2lzTkZ4YXdpeVcreE52cyt1eGU2UzVSbkhtRFBTTk1kMGR3QlpwSHlBckQ2VWdYV2JmZHBjaVFGN2Q0d2FrZGxMSThZakhKdWt1UTNwb0VVN28wSlRGYXB4RTNUbHBtV0h2dE5Vc1RxMCtDQkY5TVlUQ1dsVHhlWkkzN2o5MnBvNm11REtrbTM0WTNEUEZTN3p4ZnRvY0NkdzVOYXlWMWh1MkRHclVLZUhUNll1QkphTXEyU0IxYlhJUHpGcHpkVE9FcWdHbnNBelR1dHRET0xmYi8yaEN3QVZhMGlMMTlRcmNTYUZVKy8wK1FZcUd0cGZLbk5WWXhncllncEZKaUFDdGtZNGJGNS9ubHhJMFJybUxIIGphbWVzQGphbWVzLXVsdHJhYm9vawo=

---
apiVersion: v1
kind: Secret
metadata:
  name: edge-cluster-ssh-private-key
  namespace: edge-cluster
stringData:
  ssh-privatekey: |-
    ${SSH_PRIVATE_KEY}
type: Opaque

---
apiVersion: v1
kind: Secret
type: Opaque
metadata:
  name: edge-cluster-aws-creds
  namespace: edge-cluster
stringData:
  aws_access_key_id: ${AWS_ACCESS_KEY}
  aws_secret_access_key: ${AWS_SECRET_ACCESS_KEY}

---
apiVersion: agent.open-cluster-management.io/v1
kind: KlusterletAddonConfig
metadata:
  name: edge-cluster
  namespace: edge-cluster
spec:
  clusterName: edge-cluste
  clusterNamespace: edge-cluster
  clusterLabels:
    cloud: Amazon
    vendor: OpenShift
  applicationManager:
    enabled: true
  policyController:
    enabled: true
  searchCollector:
    enabled: true
  certPolicyController:
    enabled: true

EOF
#+end_src

#+RESULTS: Create clusterdeployment resource
#+begin_example
clusterdeployment.hive.openshift.io/edge-cluster created
managedcluster.cluster.open-cluster-management.io/edge-cluster created
machinepool.hive.openshift.io/edge-cluster-worker created
secret/edge-cluster-pull-secret created
secret/edge-cluster-install-config created
secret/edge-cluster-ssh-private-key created
secret/edge-cluster-aws-creds created
klusterletaddonconfig.agent.open-cluster-management.io/edge-cluster created
#+end_example
